user-4.1/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/system/region_fluid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance           1e-6;

pointSync                true;

patchInfo
(
    {
        name             atmosphere;
        constructFrom    set;
        set              faceSet_patch_atmosphere;

        dictionary
        {
            type         patch;
        }
    }

    {
        name             sideWall;
        constructFrom    set;
        set              faceSet_patch_sideWall;

        dictionary
        {
            type         wall;
        }
    }

    {
        name             bottomWall;
        constructFrom    set;
        set              faceSet_patch_bottomWall;

        dictionary
        {
            type         wall;
        }
    }
);

// ************************************************************************* //
