user-4.1/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/constant/region_fluid/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// simulationType    laminar;
// simulationType    LESModel;
simulationType    RASModel;

init
{
    refU          0.100;
    refI          0.100;
    refL          0.001;
}

// ************************************************************************* //
