user-4.1/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/0.org/region_fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    axis
    {
        type            slip;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    atmosphere
    {
        type            calculated;
        value           $internalField;
    }
    sideWall
    {
        type            nutWallFunction;
//         type            nutUWallFunction;
//         type            nutkWallFunction;
//         type            nutkRoughWallFunction;
//         type            nutURoughWallFunction;
//         type            nutUSpaldingWallFunction;
        value           $internalField;
    }
    bottomWall
    {
        type            nutWallFunction;
//         type            nutUWallFunction;
//         type            nutkWallFunction;
//         type            nutkRoughWallFunction;
//         type            nutURoughWallFunction;
//         type            nutUSpaldingWallFunction;
        value           $internalField;
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}

// ************************************************************************* //

