user-4.1/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/system/region_fluid/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    alpha1_reset
    {
        field         alpha1;
        expression    "0";
        keepPatches   true;
    }

    alpha1_air
    {
        field         alpha1;
        expression    "0";
        condition     "set(cellSet_material_woodsandair)";
        keepPatches   true;
    }

    alpha1_woodsmetal
    {
        field         alpha1;
        expression    "1";
        condition     "set(cellSet_material_woodsandair) && pos().z < 0.235";
        keepPatches   true;
    }
);

// ************************************************************************* //
