user-4.1/tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/system/solverProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solverProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
{
    CONDUCTOR               region_conductor;
    FLUID                   region_fluid;
}

settings
{
    biotSavart              true;
    lorentzForce            true;
    magneticPressure        true;
    jouleHeat               true;

    region_fluid
    {
        volumeForce         true;
        electricalConuctivity true;
        snGradpFromFlux     true;
    }
}

storage
{
//     "(BRe|BIm)"
//     {
//         write               false;
//     }
//
//     "F"
//     {
//         write               false;
//     }
//
//     "Q"
//     {
//         write               false;
//     }
//
//     region_conductor
//     {
//         "(jRe|jIm)"
//         {
//             write           false;
//         }
//     }
}

// ************************************************************************* //
